
# pandas

**
1. python package for data analysis
2. pandas is a manupulation package in python for tabular data.
3. that is data in  the form of rows and columns ,also known as dataframes.
4. A data frame as an excelsheet.
5. pandas functionality includes data transformations,like sorting rows and taking sunsets to caluting.
**

In [1]:
import pandas as pd

# python pandas data  structure

two tye of pandas data structure
1. series
2.Dataframe

In [2]:
list=[10,20,30,40,50]
S= pd.Series(list)
print(S)
print(type(S))

0    10
1    20
2    30
3    40
4    50
dtype: int64
<class 'pandas.core.series.Series'>

In [3]:
a=pd.array(["p","a","n","d","a","s"])
b=pd.Series(a)
print(b)
print(type(b))

0    p
1    a
2    n
3    d
4    a
5    s
dtype: string
<class 'pandas.core.series.Series'>

# we can create series by using variours inputs

# array

In [4]:
import numpy as np
arr=np.array([21,4,65,44,887,54])
print(arr)
array=pd.Series(arr)
print(array)

[ 21   4  65  44 887  54]
0     21
1      4
2     65
3     44
4    887
5     54
dtype: int32

# dictionary

In [5]:
dic={"name":"Data","roll":2,"salary":3400}
dict=pd.Series(dic)
print(dict)

name      Data
roll         2
salary    3400
dtype: object

# scalar value

In [6]:
tuple=("data",12,"network",45)
df=pd.Series(tuple)
df

0       data
1         12
2    network
3         45
dtype: object

In [7]:
import pandas as pd

In [8]:
x=pd.read_csv("file1.csv")

In [9]:
x

           Day  wind_speed  tempreture
0   01-10-2023        40.0        20.0
1   02-10-2023         NaN        20.0
2   03-10-2023         NaN        12.0
3   04-10-2023         NaN        20.0
4   05-10-2023         NaN        20.0
5   06-10-2023         NaN        20.0
6   07-10-2023         NaN        -3.0
7   08-10-2023         NaN        -2.0
8   09-10-2023         NaN        20.0
9   10-10-2023         NaN        20.0
10  11-10-2023         NaN         NaN

In [10]:
x.shape

(11, 3)

In [11]:
x.head()

          Day  wind_speed  tempreture
0  01-10-2023        40.0        20.0
1  02-10-2023         NaN        20.0
2  03-10-2023         NaN        12.0
3  04-10-2023         NaN        20.0
4  05-10-2023         NaN        20.0

In [12]:
x.head(2)

          Day  wind_speed  tempreture
0  01-10-2023        40.0        20.0
1  02-10-2023         NaN        20.0

In [13]:
x.tail()

           Day  wind_speed  tempreture
6   07-10-2023         NaN        -3.0
7   08-10-2023         NaN        -2.0
8   09-10-2023         NaN        20.0
9   10-10-2023         NaN        20.0
10  11-10-2023         NaN         NaN

In [14]:
x[2:5]

          Day  wind_speed  tempreture
2  03-10-2023         NaN        12.0
3  04-10-2023         NaN        20.0
4  05-10-2023         NaN        20.0

In [15]:
x.columns

Index(['Day', 'wind_speed', 'tempreture'], dtype='object')

In [16]:
x['tempreture'].max()

20.0

In [17]:
x['tempreture'].min()

-3.0

In [18]:
x['tempreture'].std()

9.405081368896049

In [19]:
x['tempreture'].mean()

14.7

In [20]:
x.size

33

In [21]:
x.describe()

       wind_speed  tempreture
count         1.0   10.000000
mean         40.0   14.700000
std           NaN    9.405081
min          40.0   -3.000000
25%          40.0   14.000000
50%          40.0   20.000000
75%          40.0   20.000000
max          40.0   20.000000

In [22]:
x[x.tempreture>=20]

          Day  wind_speed  tempreture
0  01-10-2023        40.0        20.0
1  02-10-2023         NaN        20.0
3  04-10-2023         NaN        20.0
4  05-10-2023         NaN        20.0
5  06-10-2023         NaN        20.0
8  09-10-2023         NaN        20.0
9  10-10-2023         NaN        20.0

# by using dictonary,tuple pandas

In [23]:
import pandas as pd
d = {'col1': [1, 2], 'col2': [3, 4]}
df = pd.DataFrame(data=d)
df

   col1  col2
0     1     3
1     2     4

In [24]:
import pandas as pd
list=[12,34,56,45,88,65]
df=pd.DataFrame(list,index=["n1","n2","n3","n4","n5","n6"])
df

     0
n1  12
n2  34
n3  56
n4  45
n5  88
n6  65

2D list in pandas........................

In [25]:
list=[[12,23,43,345,5,67],[45,34,67,89,9,6]]
df=pd.DataFrame(list)
df

    0   1   2    3  4   5
0  12  23  43  345  5  67
1  45  34  67   89  9   6

In [26]:
list=[["abhayraj",89],["rahul",87],["unity",99],["prakhar",55]]
df=pd.DataFrame(list,columns=["name","marks"])
df

       name  marks
0  abhayraj     89
1     rahul     87
2     unity     99
3   prakhar     55

using dictionary

In [27]:
dic={"name":["harry","amandttawal","lovebabber","nishant","rishabh"],"marks":[65,87,67,90,76]}
df=pd.DataFrame(dic,index=["stu1","stu2","stu3","stu4","stu5"])
df

             name  marks
stu1        harry     65
stu2  amandttawal     87
stu3   lovebabber     67
stu4      nishant     90
stu5      rishabh     76

using zip function

In [28]:
Names=("shradhakhapre","dramebaaz","nautanki","zeevani","AUEA")
Marks=(34,56,87,54,34)
df=tuple(zip(Names,Marks))
df

TypeError: 'tuple' object is not callable

In [ ]:
dt=pd.DataFrame(df)
dt

In [ ]:
data={"uinty":pd.Series([87,98,65,98,90]),"abhayraj":pd.Series([67,56,87,90,54])}
df=pd.DataFrame(data)
df

In [ ]:
data={"uinty":[87,98,65,98,90],"abhayraj": [67,56,87,90,54]}
df=pd.DataFrame(data)
print(df)
print("printing....")
df.dtypes

In [ ]:
df2 = pd.DataFrame(np.array([[1, 2, 3], [4, 5, 6], [7, 8, 9]]),
                   columns=['a', 'b', 'c'])
df2

In [ ]:
df2 = pd.DataFrame(np.array([[1, 2, 3], [4, 5, 6], [7, 8, 9]]))
df2

In [ ]:
df=pd.read_csv("weather.csv")

In [ ]:
df

In [ ]:
df.min()

In [ ]:
df.max()

In [ ]:
df.describe()

In [ ]:
df.shape

In [ ]:
df.head()

In [ ]:
df.tail()

In [ ]:
df.head(3)

In [ ]:
df.columns

In [ ]:
df.event

In [ ]:
df["event"]

In [ ]:
type(df["event"])

In [ ]:
df[["event","day"]]

In [ ]:
df['temperature'].max

In [ ]:
df['temperature'].min

In [ ]:
df['temperature'].std

In [ ]:
df['day'][df.temperature==df['temperature'].max()]

In [ ]:
df['day'][df.temperature==df['temperature'].max()]

In [ ]:
df[['day','temperature']][df.temperature==df['temperature'].max()]

In [ ]:
df.set_index('day')

In [ ]:
df

In [ ]:
df.set_index('day' ,inplace=True)

In [ ]:
df

In [ ]:
df.reset_index(inplace=True)

In [ ]:
df

In [ ]:
df.set_index('event',inplace=True)
df

In [ ]:
import pandas as pd
weather={
    'day':['1/2/2023','2/2/2023','3/2/2023'],
    'tempreature':[34,45,67],
    'windspeed':[5,6,7],
    'event':['rain','sunny','snow']
}

In [ ]:
dt=pd.DataFrame(weather,index=['n1','n2','n3'])

In [ ]:
dt

# tuple

In [ ]:
wdata=[
    ('1/1/2023',34,6,'rain'),
    ('2/2/2023',45,6,'sunny'),
    ('3/3/2023',43,5,'snow'),
]

In [ ]:
df=pd.DataFrame(wdata,columns=['day','tempreature','windspeed','event'])

In [ ]:
df

In [ ]:
import pandas as pd
df=pd.read_excel("stock_data.xlsx","Sheet1")
df

In [ ]:
def rep(df):
    df['revenue']=df['revenue'].replace(-1,0)

In [ ]:
rep(df)
df

In [ ]:
x=df.replace(-1,0)
x

In [ ]:
import pandas as pd
df=pd.read_excel("stock_data.xlsx","Sheet1")#load file
df

In [ ]:
df=pd.read_csv("stock_data.csv")
df

In [ ]:
df=pd.read_csv("stock_data.csv",skiprows=1)
df

In [ ]:
df=pd.read_csv("stock_data.csv",header=1)#skiprows and header are kind of same
df

In [ ]:
df=pd.read_csv("stock_data.csv",header=None,names=["tickers","eps","revenue","people"])
df

In [ ]:
df=pd.read_csv("stock_data.csv",nrows=2)
df

In [ ]:
df=pd.read_csv("stock_data.csv",na_values=["n.a","not available"])
df

In [ ]:
 df=pd.read_csv("stock_data.csv",na_values={
     'eps':['not available'],
     'revenue':[-1],
     'people':['not available','n.a']
 })
df

# write to csv

In [ ]:
df.to_csv("new.csv",index=False)
df

In [ ]:
df.columns

In [ ]:
df.to_csv("new.csv",header=False)

In [ ]:
df.to_csv("new.csv",columns=["tickers","price"],index=False)
df

In [ ]:
import pandas as pd
df=pd.read_excel("stock_data.xlsx","Sheet1")
df

In [ ]:
def convert_people_cell(cell):
    if cell=='n.a.':
        return 'eliminate'
    return cell
def convert_price_cell(cell):
    if cell=='n.a.':
        return 50
    return cell
df=pd.read_excel("stock_data.xlsx","Sheet1",converters={
    'people':convert_people_cell,
    'price':convert_price_cell
})
df

In [ ]:
df.to_excel("new.xlsx",sheet_name="stocks",index=False,startrow=2,startcol=1)
df

In [ ]:
df.to_excel("new.xlsx",sheet_name="stocks",index=False,startrow=2,startcol=1)

**write two dataframe to two separte sheet in excel**

In [ ]:
df_stocks=pd.DataFrame({
    'tickers':['GOOGL','WMT','MSFT'],
    'price':[845,65,64],
    'pe':[30.37,14.26,30.97],
    'eps':[27.82,4.61,2.12]
})

df_weather=pd.DataFrame({
    'day':['1/1/2017','1/2/2012','1/3/2017'],
    'tempreature':[32,35,28],
    'event':['Rain','Sunny','Snow']
})

In [ ]:
df.to_excel("new.xlsx",sheet_name="stocks",index=False,startrow=2,startcol=1)

In [ ]:
with pd.ExcelWriter('stocks_weather.xlsx')as writer:
    df_stocks.to_excel(writer,sheet_name="stocks")
    df_weather.to_excel(writer,sheet_name="weather")

# HANDLING MISSING DATA =FILLNA,INTERPOLATE ,DROPNA

In [29]:
import pandas as pd

In [45]:
df=pd.read_csv("missing.csv",parse_dates=['day'])
type(df.day[0])
df

         day  temperature  windspeed   event
0 2017-01-01         32.0        6.0    Rain
1 2017-01-04          NaN        9.0   Sunny
2 2017-01-05         28.0        NaN    Snow
3 2017-01-06          NaN        7.0     NaN
4 2017-01-07         32.0        NaN    Rain
5 2017-01-08          NaN        NaN   Sunny
6 2017-01-09          NaN        NaN     NaN
7 2017-01-10         34.0        8.0  Cloudy
8 2017-01-11         40.0       12.0   Sunny

In [46]:
df.set_index('day',inplace=True)
df

            temperature  windspeed   event
day
2017-01-01         32.0        6.0    Rain
2017-01-04          NaN        9.0   Sunny
2017-01-05         28.0        NaN    Snow
2017-01-06          NaN        7.0     NaN
2017-01-07         32.0        NaN    Rain
2017-01-08          NaN        NaN   Sunny
2017-01-09          NaN        NaN     NaN
2017-01-10         34.0        8.0  Cloudy
2017-01-11         40.0       12.0   Sunny

# fillna

In [47]:
df['temperature'].mean()

33.2

In [56]:
df['windspeed'].mean()

33.2

In [48]:
df.isnull().sum()

temperature    4
windspeed      4
event          2
dtype: int64

In [49]:
df['temperature']=df.fillna(df['temperature'].mean())
df

           temperature  windspeed   event
day
2017-01-01          32        6.0    Rain
2017-01-04        33.2        9.0   Sunny
2017-01-05          28        NaN    Snow
2017-01-06        33.2        7.0     NaN
2017-01-07          32        NaN    Rain
2017-01-08        33.2        NaN   Sunny
2017-01-09        33.2        NaN     NaN
2017-01-10          34        8.0  Cloudy
2017-01-11          40       12.0   Sunny

In [50]:
df['windspeed']=df.fillna(df['windspeed'].mean())
df

           temperature windspeed   event
day
2017-01-01          32        32    Rain
2017-01-04        33.2      33.2   Sunny
2017-01-05          28        28    Snow
2017-01-06        33.2      33.2     NaN
2017-01-07          32        32    Rain
2017-01-08        33.2      33.2   Sunny
2017-01-09        33.2      33.2     NaN
2017-01-10          34        34  Cloudy
2017-01-11          40        40   Sunny

In [51]:
new_df=df.fillna(0)
new_df

            temperature  windspeed   event
day
2017-01-01         32.0       32.0    Rain
2017-01-04         33.2       33.2   Sunny
2017-01-05         28.0       28.0    Snow
2017-01-06         33.2       33.2       0
2017-01-07         32.0       32.0    Rain
2017-01-08         33.2       33.2   Sunny
2017-01-09         33.2       33.2       0
2017-01-10         34.0       34.0  Cloudy
2017-01-11         40.0       40.0   Sunny

In [52]:
new_df =df.fillna({
    'temperature':0,
    'windspeed':0,
    'event':'No event'
})
new_df

            temperature  windspeed     event
day
2017-01-01         32.0       32.0      Rain
2017-01-04         33.2       33.2     Sunny
2017-01-05         28.0       28.0      Snow
2017-01-06         33.2       33.2  No event
2017-01-07         32.0       32.0      Rain
2017-01-08         33.2       33.2     Sunny
2017-01-09         33.2       33.2  No event
2017-01-10         34.0       34.0    Cloudy
2017-01-11         40.0       40.0     Sunny

# USE METHOD TO DETERMINE HOW TO FILL NA VALUES

In [53]:
new_df=df.fillna(method="ffill")
new_df

            temperature  windspeed   event
day
2017-01-01         32.0       32.0    Rain
2017-01-04         33.2       33.2   Sunny
2017-01-05         28.0       28.0    Snow
2017-01-06         33.2       33.2    Snow
2017-01-07         32.0       32.0    Rain
2017-01-08         33.2       33.2   Sunny
2017-01-09         33.2       33.2   Sunny
2017-01-10         34.0       34.0  Cloudy
2017-01-11         40.0       40.0   Sunny

# interplote

In [54]:
new_df=df.interpolate()
new_df

TypeError: Cannot interpolate with all object-dtype columns in the DataFrame. Try setting at least one column to a numeric dtype.

In [ ]:
df.interpolate(method='linear', axis=0, limit=None, inplace=False, limit_direction=None, limit_area=None, downcast=None)

In [55]:
import numpy as np
import pandas as pd
df1=pd.DataFrame({'A':[1,2,np.nan,4,np.nan],'B':[5,np.nan,7,np.nan,9]})
df1

     A    B
0  1.0  5.0
1  2.0  NaN
2  NaN  7.0
3  4.0  NaN
4  NaN  9.0

In [57]:
df1.interpolate()

     A    B
0  1.0  5.0
1  2.0  6.0
2  3.0  7.0
3  4.0  8.0
4  4.0  9.0

# dropna

In [ ]:
new_